app/views/phase/show.html.erb

nb_win :<%= @phase.nb_win %><br/>
<% t = Tournoi.find(@phase.tournoi_id) %>
---
SELECT  "tournois".* FROM "tournois"  WHERE "tournois"."id" = ? LIMIT 1  [["id", 1]]