app/controllers/phase_controller.rb

SELECT  "tournois".* FROM "tournois"  WHERE "tournois"."id" = ? LIMIT 1  [["id", 1]]
---
	def create_view
		begin
	      t = Tournoi.find(params[:tournoi_id])

INSERT INTO "phases" ("created_at", "description", "name", "nb_win", "slug", "tournoi_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		phase = Phase.new
		phase.name = params[:name]
		phase.description = params[:description]
		phase.nb_win = params[:nb_win]
		phase.tournoi_id = params[:tournoi_id]
		begin
			phase.save

SELECT  "phases".* FROM "phases"  WHERE "phases"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
	    begin
	      @phase = Phase.friendly.find(params[:id])