app/controllers/tournoi_controller.rb

INSERT INTO "tournois" ("cash_prize", "created_at", "date", "description", "name", "nb_phase", "slug", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    tournoi = Tournoi.new
    tournoi.name = params[:name]
    tournoi.nb_player = params[:nb_player]
    tournoi.date = params[:date]
    tournoi.nb_phase = params[:nb_phase]
    tournoi.cash_prize = params[:cash_prize]
    tournoi.description = params[:description]
    tournoi.price = params[:price]
    tournoi.user_id = current_user.id
    begin
      tournoi.save

SELECT "tournois".* FROM "tournois"
---
  def index
    @tournois = Tournoi.all

SELECT  "tournois".* FROM "tournois"  WHERE "tournois"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    begin
      @tournoi = Tournoi.friendly.find(params[:id])