app/controllers/tournoi_controller.rb

  def list
    @tournoi = Tournoi.all
---
SELECT "tournois".* FROM "tournois"